package by.javaonline.basic1.task;

public class Cycles6 {

	public static void main(String[] args) {
		// 6. Вывести на экран соответствий между символами и их численными
		// обозначениями в памяти компьютера.

		for (int i = 32; i <= 126; i++) {
			System.out.println(i + " " + (char) i);
		}

	}

}
